tap "daipeihust/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jonz94/sarasa-nerd-fonts"
tap "remind101/formulae"
tap "stripe/stripe-cli"
brew "act"
brew "giflib"
brew "libpng"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "gettext"
brew "openssl@3"
brew "libssh2"
brew "readline"
brew "aria2"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bison"
brew "blueutil"
brew "bzip2"
brew "freetype"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "gmp"
brew "coreutils"
brew "libidn2"
brew "openldap"
brew "curl"
brew "direnv"
brew "editorconfig"
brew "fd"
brew "fribidi"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "libsodium"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "fzf"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git-secrets"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "grep"
brew "guile"
brew "htop"
brew "imagemagick"
brew "jbig2enc"
brew "jpdfbookmarks"
brew "jpeg"
brew "krb5"
brew "libedit"
brew "libfido2"
brew "libiconv"
brew "libraqm"
brew "libspiro"
brew "libuninameslist"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "luajit", args: ["HEAD"]
brew "luarocks"
brew "mcrypt"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nkf"
brew "tcl-tk"
brew "pillow"
brew "qpdf"
brew "unpaper"
brew "ocrmypdf"
brew "p7zip"
brew "pandoc"
brew "parquet-cli"
brew "peco"
brew "perl"
brew "pinentry-mac"
brew "postgresql@14"
brew "pup"
brew "re2c"
brew "ripgrep"
brew "rtx"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "tesseract-lang"
brew "tidy-html5"
brew "tmux"
brew "tnftp"
brew "tor"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh"
brew "daipeihust/tap/im-select"
brew "heroku/brew/heroku"
brew "remind101/formulae/assume-role"
brew "stripe/stripe-cli/stripe"
cask "1password"
cask "android-commandlinetools"
cask "android-studio"
cask "anki"
cask "aws-vpn-client"
cask "calibre"
cask "chatwork"
cask "clipy"
cask "clockify"
cask "cyberduck"
cask "dbeaver-community"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-ricty-diminished"
cask "font-sarasa-nerd-font-ttc"
cask "font-sauce-code-pro-nerd-font"
cask "fontforge"
cask "foxitreader"
cask "gifox"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "grammarly"
cask "gyazo"
cask "karabiner-elements"
cask "keycastr"
cask "kindle"
cask "libreoffice"
cask "licecap"
cask "mactex"
cask "nordvpn"
cask "notunes"
cask "obsidian"
cask "openmtp"
cask "postman"
cask "raycast"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "the-unarchiver"
cask "toggl-track"
cask "vlc"
cask "wezterm-nightly"
