
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'act'
brew 'aider'
brew 'aom'
brew 'aria2'
brew 'aribb24'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db@5'
brew 'bfg'
brew 'bison'
brew 'blueutil'
brew 'boost'
brew 'brotli'
brew 'bzip2'
brew 'ca-certificates'
brew 'cairo'
brew 'certifi'
brew 'cffi'
brew 'cjson'
brew 'coreutils'
brew 'cryptography'
brew 'curl'
brew 'dav1d'
brew 'direnv'
brew 'double-conversion'
brew 'edencommon'
brew 'editorconfig'
brew 'fb303'
brew 'fbthrift'
brew 'fd'
brew 'ffmpeg'
brew 'fizz'
brew 'flac'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'gifsicle'
brew 'git'
brew 'git-filter-repo'
brew 'git-secrets'
brew 'glib'
brew 'glog'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gpgme'
brew 'gradle'
brew 'graphite2'
brew 'grep'
brew 'guile'
brew 'hadolint'
brew 'harfbuzz'
brew 'highway'
brew 'htop'
brew 'hwloc'
brew 'icu4c@75'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'imagemagick'
brew 'imath'
brew 'img2pdf'
brew 'isl'
brew 'jasper'
brew 'jbig2dec'
brew 'jbig2enc'
brew 'jpdfbookmarks'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libde265'
brew 'libdeflate'
brew 'libedit'
brew 'libevent'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libheif'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libimagequant'
brew 'libksba'
brew 'liblqr'
brew 'libmicrohttpd'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libomp'
brew 'libpng'
brew 'libraqm'
brew 'libraw'
brew 'librist'
brew 'libsamplerate'
brew 'libscrypt'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libspiro'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libunibreak'
brew 'libuninameslist'
brew 'libunistring'
brew 'libusb'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lua'
brew 'luajit', args: ['HEAD']
brew 'luarocks'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'mhash'
brew 'mise'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'mvfst'
brew 'ncurses'
brew 'neofetch'
brew 'nettle'
brew 'nkf'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'numpy'
brew 'ocrmypdf'
brew 'oniguruma'
brew 'onnx'
brew 'openblas'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@17'
brew 'openjdk@21'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'openvino'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pandoc'
brew 'pango'
brew 'parquet-cli'
brew 'pcre2'
brew 'peco'
brew 'perl'
brew 'pillow'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipx'
brew 'pixman'
brew 'pkgconf'
brew 'pngquant'
brew 'poetry'
brew 'poppler'
brew 'postgresql@14'
brew 'protobuf'
brew 'pugixml'
brew 'pup'
brew 'pybind11'
brew 'pycparser'
brew 'python-packaging'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.9'
brew 'qpdf'
brew 'rav1e'
brew 're2c'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'rustup'
brew 'scipy'
brew 'screenresolution'
brew 'sdl2'
brew 'shared-mime-info'
brew 'sheldon'
brew 'shellcheck'
brew 'shfmt'
brew 'slides'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'stow'
brew 'stylua'
brew 'svt-av1'
brew 'tbb'
brew 'tcl-tk'
brew 'tesseract'
brew 'tesseract-lang'
brew 'theora'
brew 'tidy-html5'
brew 'tmux'
brew 'tnftp'
brew 'tor'
brew 'tree'
brew 'unar'
brew 'unbound'
brew 'unixodbc'
brew 'unpaper'
brew 'usage'
brew 'utf8proc'
brew 'vim'
brew 'wangle'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xorgproto'
brew 'xsimd'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yt-dlp'
brew 'zeromq'
brew 'zimg'
brew 'zk', args: ['HEAD']
brew 'zlib'
brew 'zstd'

tap 'homebrew/cask'
cask '1password'
cask '1password-cli'
cask 'android-commandlinetools'
cask 'android-studio'
cask 'anki'
cask 'aws-vpn-client'
cask 'brave-browser'
cask 'chatwork'
cask 'clipy'
cask 'clockify'
cask 'cursor'
cask 'cyberduck'
cask 'dbeaver-community'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'font-blex-mono-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hackgen-nerd'
cask 'font-ibm-plex-mono'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'font-plemol-jp'
cask 'font-plemol-jp-hs'
cask 'font-plemol-jp-nf'
cask 'font-ricty-diminished'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-victor-mono'
cask 'fontforge'
cask 'foxitreader'
cask 'gifox'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'karabiner-elements'
cask 'keycastr'
cask 'keyman'
cask 'libreoffice'
cask 'licecap'
cask 'nordvpn'
cask 'notunes'
cask 'obsidian'
cask 'openmtp'
cask 'postman'
cask 'rar'
cask 'raycast'
cask 'sequel-ace'
cask 'shottr'
cask 'skype'
cask 'slack'
cask 'the-unarchiver'
cask 'vlc'
cask 'wezterm@nightly'
cask 'zed@preview'
cask 'zoom'

tap 'daipeihust/tap'
brew 'im-select'

tap 'grishka/grishka'
cask 'neardrop'

tap 'jonz94/sarasa-nerd-fonts'
cask 'font-sarasa-nerd-font-ttc'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'stripe/stripe-cli'
brew 'stripe'

# App Store applications
mas 'Amazon Kindle (7.31)', id: 302584613
mas 'Goodnotes (6.6.33)', id: 1444383602
mas 'Keynote (14.4)', id: 409183694
mas 'LINE (9.8.1)', id: 539883307
mas 'Monosnap (6.21)', id: 540348655
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
mas 'PicGIF Lite (2.0.9)', id: 844918735
mas 'Toggl Track (10.9.1)', id: 1291898086
mas 'Xcode (16.3)', id: 497799835
